In [2]:
! pip install pandas

Looking in indexes: https://pypi.tuna.tsinghua.edu.cn/simple
Collecting pandas
  Downloading https://pypi.tuna.tsinghua.edu.cn/packages/fd/4b/0cd38e68ab690b9df8ef90cba625bf3f93b82d1c719703b8e1b333b2c72d/pandas-2.2.2-cp310-cp310-macosx_11_0_arm64.whl (11.3 MB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 11.3/11.3 MB 1.5 MB/s eta 0:00:0000:0100:01m
Requirement already satisfied: numpy>=1.22.4 in /Users/yeyehaoye/miniforge3/envs/pytorch_study/lib/python3.10/site-packages (from pandas) (1.24.3)
Requirement already satisfied: python-dateutil>=2.8.2 in /Users/yeyehaoye/miniforge3/envs/pytorch_study/lib/python3.10/site-packages (from pandas) (2.8.2)
Collecting pytz>=2020.1 (from pandas)
  Downloading https://pypi.tuna.tsinghua.edu.cn/packages/9c/3d/a121f284241f08268b21359bd425f7d4825cffc5ac5cd0e1b3d82ffd2b10/pytz-2024.1-py2.py3-none-any.whl (505 kB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 505.5/505.5 kB 3.8 MB/s eta 0:00:00a 0:00:01
Collecting tzdata>=2022.7 (from pandas)
  Downloading https://pypi.tuna.tsinghua.edu.cn/packages/65/58/f9c9e6be752e9fcb8b6a0ee9fb87e6e7a1f6bcab2cdc73f02bb7ba91ada0/tzdata-2024.1-py2.py3-none-any.whl (345 kB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 345.4/345.4 kB 1.7 MB/s eta 0:00:00a 0:00:01
Requirement already satisfied: six>=1.5 in /Users/yeyehaoye/miniforge3/envs/pytorch_study/lib/python3.10/site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Installing collected packages: pytz, tzdata, pandas
Successfully installed pandas-2.2.2 pytz-2024.1 tzdata-2024.1

In [3]:
import pandas as pd

In [18]:
str_beg, int_beg, float_beg = ord('a'), 1, .1
temp = list()
for i in range(0, 10, 2):
    temp.append({
        'str': chr(str_beg+i)*(i+1),
        'int': int_beg+i,
        'float': float_beg + i*.1
        
    })
temp_df = pd.DataFrame(temp)

In [23]:
temp_df

         str  int  float
0          a    1    0.1
1        ccc    3    0.3
2      eeeee    5    0.5
3    ggggggg    7    0.7
4  iiiiiiiii    9    0.9

In [35]:
temp_df.loc[1:2, 'str':'int']

     str  int
1    ccc    3
2  eeeee    5

In [43]:
temp_df.loc[[1,3], ('str','float')]

       str  float
1      ccc    0.3
3  ggggggg    0.7

In [48]:
temp_df.shape

(5, 3)

In [77]:
    df= pd.DataFrame(
        {
            'Name': [None, 'Bob', 'Aritra'],
            'Age': [25, 30, 35],
            'Location': ['Seattle', 'New York', 'Kona']
        },
        index=([10, 20, 30])
    )
df

      Name  Age  Location
10    None   25   Seattle
20     Bob   30  New York
30  Aritra   35      Kona

In [80]:
df.insert(0 , None, 25, 'Seattle', allow_duplicates=True)

TypeError: DataFrame.insert() got multiple values for argument 'allow_duplicates'

In [79]:
df

    None    Name  Age  Location
10    25    None   25   Seattle
20    25     Bob   30  New York
30    25  Aritra   35      Kona

In [66]:
df.fillna(value=1)

      Name  Age  Location
10       1   25   Seattle
20     Bob   30  New York
30  Aritra   35      Kona

In [64]:
df.dropna(axis=1)

    Age  Location
10   25   Seattle
20   30  New York
30   35      Kona

In [67]:
df.isin(values=['New York', 'BJ'])

     Name    Age  Location
10  False  False     False
20  False  False      True
30  False  False     False